In [13]:
import pandas as pd 
import numpy as np
import os 
from sqlalchemy import create_engine

https://stackoverflow.com/questions/48888001/creating-multiple-dataframes-with-a-loop

In [14]:
#creates a table for each csv file in a list 
# assigns a table name based on the name of the file 
# turns it into a dataframe 
#pushes the dataframe to

In [21]:
'''for file in csv_files:
    df = pd.read_csv(file)
    df.to_sql('tweet', engine, index=False # Not copying over the index)'''

"for file in csv_files:\n    df = pd.read_csv(file)\n    df.to_sql('tweet', engine, index=False # Not copying over the index)"

In [50]:
#encoding was in latin, rather than utf8
df = pd.read_csv("Targets Raw Data.csv", encoding ='latin1')

In [51]:
df.head(10)

   Account_No  Month_ID Product_Category       Target
0    99696211       143  Online Products  2984094.120
1    99696211       142  Online Products  2839413.360
2    99696211       141  Online Products  2305564.800
3    99696211       140  Online Products  2234395.800
4    99696211       139  Online Products  1750056.000
5    99696211       138  Online Products  1650417.720
6    22525115       137  Online Products  1367080.092
7    99696211       134  Online Products  1216131.000
8    22525115       136  Online Products  1211952.168
9    30606604       143  Online Products  1198774.920

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15307 entries, 0 to 15306
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Account_No        15307 non-null  int64
 1   Month_ID          15307 non-null  int64
 2   Product_Category  15307 non-null  object
 3   Target            15307 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 478.5+ KB

In [49]:
engine = create_engine('postgresql://postgres:noyS9oud!@localhost:5432/dbo.examples.marketing_practice')

In [52]:
df.to_sql('Targets Raw Data', engine, index=False) # Not copying over the index